Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
*****

In [1]:
import pandas as pd
data=[4,8,15,16,23,42]
ser=pd.Series(data)

In [2]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
*************

In [4]:

data1=[1,2,3,4,5,6,7]
ser1=pd.Series(data1)

In [5]:
ser1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

***********************
Q3. Create a Pandas DataFrame that contains the following data:

In [12]:
data2={"Name": ["Alice","Bob","Claire"], "Age":[25,30,27], "Gender":["Female","Male","Female"]}
df=pd.DataFrame(data2,index=None)

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

****
Answer: DataFrame is a two-dimensional structure with columns and rows whose size can be changed. 
Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

in below data frame df, type of df is Dataframe and type of only one column is Series.

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(df["Name"])

pandas.core.series.Series

********************************

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Answer: 
head(), tail(), describe(), read_csv(), loc(), iloc() are few common functions. 

Below is example using describe() function to show key indicators of dataframe.

In [17]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

***************
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer: DataFrames are mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [19]:
name=["Amit","Sudh","Krish"]
age=[30,31,32]
      
name_ser=pd.Series(name)
age_ser=pd.Series(age)
      
frame={"Name":name_ser,"Age":age_ser}
      
df1=pd.DataFrame(frame)
df1

    Name  Age
0   Amit   30
1   Sudh   31
2  Krish   32